Repository: Liis17/BarkFluff
Catalog: Mac/Barkfluff/Barkfluff/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, ru, zh_hans

# auth.errors.password_save_failed %@
source: Failed to save the password: %@
de: Passwort konnte nicht gespeichert werden: %@
es: No se pudo guardar la contraseña: %@
ru: Не удалось сохранить пароль: %@
zh_hans: 无法保存密码：%@

# auth.errors.register_failed %@
source: Failed to create the account: %@
de: Konto konnte nicht erstellt werden: %@
es: No se pudo crear la cuenta: %@
ru: Не удалось создать аккаунт: %@
zh_hans: 无法创建账户：%@

# auth.errors.username_check_failed %@
source: Failed to check the username: %@
de: Benutzername konnte nicht geprüft werden: %@
es: No se pudo verificar el nombre de usuario: %@
ru: Не удалось проверить имя: %@
zh_hans: 无法验证用户名：%@

# auth.login.choose_server
source: Choose server
de: Server auswählen
es: Elegir servidor
ru: Выбрать сервер
zh_hans: 选择服务器

# auth.login.create_account
source: Create account
de: Konto erstellen
es: Crear cuenta
ru: Создать аккаунт
zh_hans: 创建账户

# auth.login.password
source: Password
de: Passwort
es: Contraseña
ru: Пароль
zh_hans: 密码

# auth.login.submit
source: Sign in
de: Anmelden
es: Iniciar sesión
ru: Войти
zh_hans: 登录

# auth.login.submit_otp
source: Confirm
de: Bestätigen
es: Confirmar
ru: Подтвердить
zh_hans: 确认

# auth.login.subtitle
source: Sign in to your account
de: Melde dich bei deinem Konto an
es: Inicia sesión en tu cuenta
ru: Войдите в свой аккаунт
zh_hans: 登录您的账户

# auth.login.title
source: Sign in
de: Anmelden
es: Iniciar sesión
ru: Вход
zh_hans: 登录

# auth.login.username_or_email
source: Username or email
de: Benutzername oder E-Mail
es: Usuario o correo
ru: Имя пользователя или email
zh_hans: 用户名或邮箱

# auth.otp.placeholder
source: Confirmation code
de: Bestätigungscode
es: Código de confirmación
ru: Код подтверждения
zh_hans: 验证码

# auth.otp.submit
source: Confirm
de: Bestätigen
es: Confirmar
ru: Подтвердить
zh_hans: 确认

# auth.otp.subtitle
source: Enter the confirmation code sent to your email
de: Gib den Bestätigungscode ein, der an deine E-Mail gesendet wurde
es: Introduce el código de confirmación enviado a tu correo
ru: Введите код подтверждения, отправленный на вашу почту
zh_hans: 输入发送到您邮箱的验证码

# auth.otp.title
source: Confirmation
de: Bestätigung
es: Confirmación
ru: Подтверждение
zh_hans: 确认

# auth.password.strength.label
source: Password strength:
de: Passwortstärke:
es: Seguridad de la contraseña:
ru: Надёжность пароля:
zh_hans: 密码强度：

# auth.register.confirm
source: Confirm
de: Bestätigen
es: Confirmar
ru: Подтвердить
zh_hans: 确认

# auth.register.finish
source: Finish
de: Fertigstellen
es: Finalizar
ru: Завершить
zh_hans: 完成

# auth.register.have_account.action
source: Sign in
de: Anmelden
es: Iniciar sesión
ru: Войти
zh_hans: 登录

# auth.register.have_account.prefix
source: Already have an account?
de: Bereits ein Konto?
es: ¿Ya tienes una cuenta?
ru: Уже есть аккаунт?
zh_hans: 已有账户？

# auth.register.next
source: Next
de: Weiter
es: Siguiente
ru: Далее
zh_hans: 下一步

# auth.register.progress.step %lld %lld
source: Step %1$lld of %2$lld
de: Schritt %1$lld von %2$lld
es: Paso %1$lld de %2$lld
ru: Шаг %1$lld из %2$lld
zh_hans: 第 %1$lld 步，共 %2$lld 步

# auth.register.step.avatar.add
source: Add photo
de: Foto hinzufügen
es: Añadir foto
ru: Добавить фото
zh_hans: 添加照片

# auth.register.step.avatar.change
source: Change photo
de: Foto ändern
es: Cambiar foto
ru: Изменить фото
zh_hans: 更换照片

# auth.register.step.avatar.choose
source: Choose photo
de: Foto auswählen
es: Elegir foto
ru: Выбрать фото
zh_hans: 选择照片

# auth.register.step.avatar.error.load
source: Failed to read image
de: Bild konnte nicht gelesen werden
es: No se pudo leer la imagen
ru: Не удалось прочитать изображение
zh_hans: 无法读取图片

# auth.register.step.avatar.error.load_photo
source: Failed to load photo
de: Foto konnte nicht geladen werden
es: No se pudo cargar la foto
ru: Не удалось загрузить фото
zh_hans: 无法加载照片

# auth.register.step.avatar.error.no_access
source: No access to the file
de: Kein Zugriff auf die Datei
es: Sin acceso al archivo
ru: Нет доступа к файлу
zh_hans: 无法访问文件

# auth.register.step.avatar.error.process
source: Image processing error
de: Fehler bei der Bildverarbeitung
es: Error al procesar la imagen
ru: Ошибка обработки изображения
zh_hans: 图片处理错误

# auth.register.step.avatar.error.upload
source: Failed to upload photo
de: Foto konnte nicht hochgeladen werden
es: No se pudo subir la foto
ru: Не удалось загрузить фото
zh_hans: 无法上传照片

# auth.register.step.avatar.hint
source: You can skip this step and add an avatar later
de: Du kannst diesen Schritt überspringen und später einen Avatar hinzufügen
es: Puedes omitir este paso y añadir un avatar más tarde
ru: Вы можете пропустить этот шаг и добавить аватар позже
zh_hans: 您可以跳过此步骤，稍后添加头像

# auth.register.step.avatar.remove
source: Remove
de: Entfernen
es: Eliminar
ru: Удалить
zh_hans: 删除

# auth.register.step.avatar.subtitle
source: Upload a profile photo
de: Lade ein Profilfoto hoch
es: Sube una foto de perfil
ru: Загрузите фото профиля
zh_hans: 上传个人头像

# auth.register.step.bio.hint
source: Optional — you can fill it in later in profile settings
de: Optional — du kannst es später in den Profileinstellungen ausfüllen
es: Opcional — puedes completarlo más tarde en la configuración del perfil
ru: Не обязательно — вы можете заполнить это позже в настройках профиля
zh_hans: 可选 — 您可以稍后在个人资料设置中填写

# auth.register.step.bio.hint_short
source: Tell us about yourself
de: Erzähl etwas über dich
es: Cuéntanos sobre ti
ru: Расскажите о себе
zh_hans: 介绍一下自己

# auth.register.step.bio.label
source: About me
de: Über mich
es: Acerca de mí
ru: О себе
zh_hans: 关于我

# auth.register.step.bio.subtitle
source: Tell us about yourself
de: Erzähl etwas über dich
es: Cuéntanos sobre ti
ru: Расскажите о себе
zh_hans: 介绍一下自己

# auth.register.step.bio.title
source: About me
de: Über mich
es: Acerca de mí
ru: О себе
zh_hans: 关于我

# auth.register.step.completion.header
source: Done!
de: Fertig!
es: ¡Listo!
ru: Готово!
zh_hans: 完成！

# auth.register.step.completion.row.two_fa.enabled
source: Enabled
de: Aktiviert
es: Activado
ru: Включена
zh_hans: 已启用

# auth.register.step.completion.row.username
source: Username
de: Benutzername
es: Usuario
zh_hans: 用户名

# auth.register.step.completion.start
source: Start chatting
de: Loslegen
es: Empezar a chatear
ru: Начать общение
zh_hans: 开始聊天

# auth.register.step.completion.subtitle
source: Your account has been created
de: Dein Konto wurde erstellt
es: Tu cuenta ha sido creada
ru: Аккаунт успешно создан
zh_hans: 您的账户已创建

# auth.register.step.completion.subtitle_header
source: Account created
de: Konto erstellt
es: Cuenta creada
ru: Аккаунт создан
zh_hans: 账户已创建

# auth.register.step.completion.title
source: Welcome!
de: Willkommen!
es: ¡Bienvenido!
ru: Добро пожаловать!
zh_hans: 欢迎！

# auth.register.step.confirm_email.code.label
source: Confirmation code
de: Bestätigungscode
es: Código de confirmación
ru: Код подтверждения
zh_hans: 验证码

# auth.register.step.confirm_email.invalid
source: Incorrect code. Please try again.
de: Falscher Code. Bitte erneut versuchen.
es: Código incorrecto. Inténtalo de nuevo.
ru: Неверный код. Попробуйте снова.
zh_hans: 验证码错误。请重试。

# auth.register.step.confirm_email.missing_code_id
source: Error: code ID is missing
de: Fehler: Code-ID fehlt
es: Error: falta el identificador del código
ru: Ошибка: отсутствует codeID
zh_hans: 错误：缺少验证码 ID

# auth.register.step.confirm_email.resend
source: Resend code
de: Code erneut senden
es: Reenviar código
ru: Отправить код повторно
zh_hans: 重新发送

# auth.register.step.confirm_email.resend_cooldown %lld
source: Resend available in %lld s
de: Erneut senden in %lld s möglich
es: Disponible para reenviar en %lld s
ru: Повторная отправка через %lld сек
zh_hans: %lld 秒后可重新发送

# auth.register.step.confirm_email.sent_to
source: Code sent to
de: Code gesendet an
es: Código enviado a
ru: Код отправлен на
zh_hans: 验证码已发送至

# auth.register.step.confirm_email.subtitle
source: Enter the code from the email
de: Gib den Code aus der E-Mail ein
es: Introduce el código del correo
ru: Введите код из письма
zh_hans: 输入邮箱中的验证码

# auth.register.step.confirm_email.title
source: Confirmation
de: Bestätigung
es: Confirmación
ru: Подтверждение
zh_hans: 确认

# auth.register.step.confirm_email.verified
source: Email confirmed
de: E-Mail bestätigt
es: Correo confirmado
ru: Email подтверждён
zh_hans: 邮箱已确认

# auth.register.step.confirm_email.verifying
source: Verifying code…
de: Code wird überprüft…
es: Verificando código…
ru: Проверка кода…
zh_hans: 正在验证…

# auth.register.step.email.available
source: Email available
de: E-Mail verfügbar
es: Correo disponible
ru: Email доступен
zh_hans: 邮箱可用

# auth.register.step.email.label
source: Email address
de: E-Mail-Adresse
es: Dirección de correo
ru: Email адрес
zh_hans: 邮箱地址

# auth.register.step.email.subtitle
source: Provide your email
de: Gib deine E-Mail-Adresse an
es: Indica tu correo
ru: Укажите ваш email
zh_hans: 输入您的邮箱

# auth.register.step.email.taken
source: This email is already registered
de: Diese E-Mail ist bereits registriert
es: Este correo ya está registrado
ru: Этот email уже зарегистрирован
zh_hans: 此邮箱已注册

# auth.register.step.password.confirm.label
source: Confirm password
de: Passwort bestätigen
es: Confirmar contraseña
ru: Подтвердите пароль
zh_hans: 确认密码

# auth.register.step.password.confirm.placeholder
source: Confirm password
de: Passwort bestätigen
es: Confirmar contraseña
ru: Подтвердите пароль
zh_hans: 确认密码

# auth.register.step.password.label
source: Password
de: Passwort
es: Contraseña
ru: Пароль
zh_hans: 密码

# auth.register.step.password.match
source: Passwords match
de: Passwörter stimmen überein
es: Las contraseñas coinciden
ru: Пароли совпадают
zh_hans: 密码匹配

# auth.register.step.password.mismatch
source: Passwords do not match
de: Passwörter stimmen nicht überein
es: Las contraseñas no coinciden
ru: Пароли не совпадают
zh_hans: 密码不匹配

# auth.register.step.password.placeholder
source: Password
de: Passwort
es: Contraseña
ru: Пароль
zh_hans: 密码

# auth.register.step.password.req.digit
source: Digit
de: Ziffer
es: Dígito
ru: Цифра
zh_hans: 数字

# auth.register.step.password.req.length
source: At least 8 characters
de: Mindestens 8 Zeichen
es: Al menos 8 caracteres
ru: Минимум 8 символов
zh_hans: 至少 8 个字符

# auth.register.step.password.req.lowercase
source: Lowercase letter
de: Kleinbuchstabe
es: Letra minúscula
ru: Строчная буква
zh_hans: 小写字母

# auth.register.step.password.req.special
source: Special character
de: Sonderzeichen
es: Carácter especial
ru: Специальный символ
zh_hans: 特殊字符

# auth.register.step.password.req.uppercase
source: Uppercase letter
de: Großbuchstabe
es: Letra mayúscula
ru: Заглавная буква
zh_hans: 大写字母

# auth.register.step.password.requirements
source: Requirements:
de: Anforderungen:
es: Requisitos:
ru: Требования:
zh_hans: 要求：

# auth.register.step.password.subtitle
source: Create a strong password
de: Erstelle ein starkes Passwort
es: Crea una contraseña segura
ru: Придумайте надёжный пароль
zh_hans: 创建一个强密码

# auth.register.step.password.title
source: Password
de: Passwort
es: Contraseña
ru: Пароль
zh_hans: 密码

# auth.register.step.personal_info.first_name.label
source: First name
de: Vorname
es: Nombre
ru: Имя
zh_hans: 名字

# auth.register.step.personal_info.first_name.placeholder
source: John
de: Max
es: Juan
ru: Иван
zh_hans: 小明

# auth.register.step.personal_info.last_name.label
source: Last name
de: Nachname
es: Apellido
ru: Фамилия
zh_hans: 姓氏

# auth.register.step.personal_info.last_name.placeholder
source: Doe
de: Mustermann
es: Pérez
ru: Иванов
zh_hans: 张

# auth.register.step.personal_info.subtitle
source: What's your name?
de: Wie heißt du?
es: ¿Cómo te llamas?
ru: Как вас зовут?
zh_hans: 您叫什么名字？

# auth.register.step.personal_info.title
source: Personal info
de: Persönliche Daten
es: Datos personales
ru: Личные данные
zh_hans: 个人信息

# auth.register.step.two_fa.app_code
source: Enter the code from the app:
de: Gib den Code aus der App ein:
es: Introduce el código de la app:
ru: Введите код из приложения:
zh_hans: 输入应用中的验证码：

# auth.register.step.two_fa.enable
source: Enable 2FA
de: 2FA aktivieren
es: Activar 2FA
ru: Включить 2FA
zh_hans: 启用二步验证

# auth.register.step.two_fa.enable_later
source: You can skip this step and enable 2FA later in Settings
de: Du kannst diesen Schritt überspringen und 2FA später in den Einstellungen aktivieren
es: Puedes omitir este paso y activar la 2FA más tarde en Ajustes
ru: Вы можете пропустить этот шаг и включить 2FA позже в настройках
zh_hans: 您可以跳过此步骤，稍后在设置中启用二步验证

# auth.register.step.two_fa.error.enable
source: Failed to enable 2FA
de: 2FA konnte nicht aktiviert werden
es: No se pudo activar la 2FA
ru: Не удалось включить 2FA
zh_hans: 无法启用二步验证

# auth.register.step.two_fa.error.invalid
source: Incorrect code. Please try again.
de: Falscher Code. Bitte erneut versuchen.
es: Código incorrecto. Inténtalo de nuevo.
ru: Неверный код. Попробуйте снова.
zh_hans: 验证码错误。请重试。

# auth.register.step.two_fa.manual_hint
source: Or enter the code manually:
de: Oder gib den Code manuell ein:
es: O introduce el código manualmente:
ru: Или введите код вручную:
zh_hans: 或手动输入验证码：

# auth.register.step.two_fa.offer.description
source: Two-factor authentication adds an extra layer of protection to your account.
de: Die Zwei-Faktor-Authentifizierung bietet deinem Konto zusätzlichen Schutz.
es: La autenticación en dos pasos añade una capa adicional de protección a tu cuenta.
ru: Двухфакторная аутентификация добавляет дополнительный уровень защиты вашему аккаунту.
zh_hans: 二步验证为您的账户增加一层额外的保护。

# auth.register.step.two_fa.scan_hint
source: Scan the QR code in Google Authenticator or a similar app
de: Scanne den QR-Code mit Google Authenticator oder einer ähnlichen App
es: Escanea el QR con Google Authenticator o una app similar
ru: Отсканируйте QR-код в приложении Google Authenticator или аналогичном
zh_hans: 使用 Google Authenticator 或类似应用扫描二维码

# auth.register.step.two_fa.subtitle
source: Add an extra layer of protection
de: Füge eine zusätzliche Schutzebene hinzu
es: Añade una capa extra de protección
ru: Добавьте дополнительную защиту
zh_hans: 添加额外的保护层

# auth.register.step.two_fa.success.description
source: Now you'll need an authenticator app code to sign in to your account
de: Ab jetzt brauchst du einen Authenticator-Code, um dich anzumelden
es: Ahora necesitarás un código de la app autenticadora para iniciar sesión
ru: Теперь при входе в аккаунт вам понадобится код из приложения-аутентификатора
zh_hans: 现在登录账户需要使用认证器应用中的验证码

# auth.register.step.two_fa.success.title
source: Two-factor authentication enabled!
de: Zwei-Faktor-Authentifizierung aktiviert!
es: ¡Autenticación en dos pasos activada!
ru: Двухфакторная аутентификация включена!
zh_hans: 二步验证已启用！

# auth.register.step.two_fa.title
source: Two-factor authentication
de: Zwei-Faktor-Authentifizierung
es: Autenticación en dos pasos
ru: Двухфакторная аутентификация
zh_hans: 两步验证

# auth.register.step.username.available
source: Username available
de: Benutzername verfügbar
es: Usuario disponible
ru: Имя доступно
zh_hans: 用户名可用

# auth.register.step.username.hint
source: 3-30 characters: letters, digits, _ and -
de: 3–30 Zeichen: Buchstaben, Ziffern, _ und -
es: 3–30 caracteres: letras, dígitos, _ y -
ru: 3-30 символов: буквы, цифры, _ и -
zh_hans: 3–30 个字符：字母、数字、_ 和 -

# auth.register.step.username.label
source: Username
de: Benutzername
es: Nombre de usuario
ru: Имя пользователя
zh_hans: 用户名

# auth.register.step.username.placeholder
source: @username
de: @benutzername
es: @usuario
zh_hans: @用户名

# auth.register.step.username.req.chars
source: Letters, digits, _ and -
de: Buchstaben, Ziffern, _ und -
es: Letras, dígitos, _ y -
ru: Буквы, цифры, _ и -
zh_hans: 字母、数字、_ 和 -

# auth.register.step.username.req.length
source: 3-30 characters
de: 3–30 Zeichen
es: 3–30 caracteres
ru: 3-30 символов
zh_hans: 3–30 个字符

# auth.register.step.username.req.no_digit_start
source: Doesn't start with a digit
de: Beginnt nicht mit einer Ziffer
es: No empieza por un dígito
ru: Не начинается с цифры
zh_hans: 不能以数字开头

# auth.register.step.username.subtitle
source: Choose a unique username
de: Wähle einen eindeutigen Benutzernamen
es: Elige un nombre de usuario único
ru: Выберите уникальное имя пользователя
zh_hans: 选择一个独特的用户名

# auth.register.step.username.taken
source: This username is already taken
de: Dieser Benutzername ist bereits vergeben
es: Este nombre de usuario ya está en uso
ru: Это имя уже занято
zh_hans: 该用户名已被占用

# auth.register.step.username.title
source: Username
de: Benutzername
es: Nombre de usuario
ru: Имя пользователя
zh_hans: 用户名

# auth.server_selection.connect
source: Connect
de: Verbinden
es: Conectar
ru: Подключиться
zh_hans: 连接

# auth.server_selection.connect_failed %@ %@
source: Failed to connect to %1$@: %2$@
de: Verbindung zu %1$@ fehlgeschlagen: %2$@
es: No se pudo conectar a %1$@: %2$@
ru: Не удалось подключиться к %1$@: %2$@
zh_hans: 无法连接到 %1$@：%2$@

# auth.server_selection.empty.hint
source: Connect manually below
de: Unten manuell verbinden
es: Conéctate manualmente abajo
ru: Подключитесь вручную ниже
zh_hans: 在下方手动连接

# auth.server_selection.empty.title
source: No servers available
de: Keine Server verfügbar
es: No hay servidores disponibles
ru: Нет доступных серверов
zh_hans: 无可用服务器

# auth.server_selection.load_error
source: Failed to load the server list
de: Serverliste konnte nicht geladen werden
es: No se pudo cargar la lista de servidores
ru: Не удалось загрузить список серверов
zh_hans: 无法加载服务器列表

# auth.server_selection.manual.address
source: Server address
de: Serveradresse
es: Dirección del servidor
ru: Адрес сервера
zh_hans: 服务器地址

# auth.server_selection.manual.title
source: or manually
de: oder manuell
es: o manualmente
ru: или вручную
zh_hans: 或手动

# auth.server_selection.searching
source: Searching for servers…
de: Server werden gesucht…
es: Buscando servidores…
ru: Поиск серверов…
zh_hans: 正在搜索服务器…

# auth.server_selection.subtitle
source: Connect to a BarkFluff server
de: Mit einem BarkFluff-Server verbinden
es: Conéctate a un servidor BarkFluff
ru: Подключитесь к серверу BarkFluff
zh_hans: 连接到 BarkFluff 服务器

# auth.server_selection.title
source: Choose a server
de: Server auswählen
es: Elegir servidor
ru: Выбор сервера
zh_hans: 选择服务器

# auth.success.logout
source: Sign out
de: Abmelden
es: Cerrar sesión
ru: Выйти
zh_hans: 退出

# auth.success.title
source: Authentication successful!
de: Anmeldung erfolgreich!
es: ¡Autenticación exitosa!
ru: Авторизация прошла успешно!
zh_hans: 认证成功！

# auth.success.welcome
source: Welcome to BarkFluff
de: Willkommen bei BarkFluff
es: Bienvenido a BarkFluff
ru: Добро пожаловать в BarkFluff
zh_hans: 欢迎使用 BarkFluff

# auth.validation.email.empty
source: Enter an email
de: E-Mail eingeben
es: Introduce un correo
ru: Введите email
zh_hans: 请输入邮箱

# auth.validation.email.invalid_domain
source: Invalid domain
de: Ungültige Domain
es: Dominio no válido
ru: Некорректный домен
zh_hans: 无效的域名

# auth.validation.email.invalid_format
source: Invalid email format
de: Ungültiges E-Mail-Format
es: Formato de correo no válido
ru: Некорректный формат email
zh_hans: 邮箱格式无效

# auth.validation.email.starts_with_at
source: Email cannot start with @
de: E-Mail darf nicht mit @ beginnen
es: El correo no puede empezar con @
ru: Email не может начинаться с @
zh_hans: 邮箱不能以 @ 开头

# auth.validation.name.first.empty
source: Enter your first name
de: Vornamen eingeben
es: Introduce tu nombre
ru: Введите имя
zh_hans: 请输入名字

# auth.validation.name.first.invalid_chars
source: First name may contain letters only
de: Vorname darf nur Buchstaben enthalten
es: El nombre solo puede contener letras
ru: Имя может содержать только буквы
zh_hans: 名字只能包含字母

# auth.validation.name.first.too_long %lld
source: First name must be at most %lld characters
de: Vorname darf höchstens %lld Zeichen lang sein
es: El nombre debe tener como máximo %lld caracteres
ru: Имя не должно превышать %lld символов
zh_hans: 名字最多 %lld 个字符

# auth.validation.name.first.too_short %lld
source: First name must be at least %lld characters
de: Vorname muss mindestens %lld Zeichen lang sein
es: El nombre debe tener al menos %lld caracteres
ru: Имя должно содержать минимум %lld символа
zh_hans: 名字至少 %lld 个字符

# auth.validation.name.last.invalid_chars
source: Last name may contain letters only
de: Nachname darf nur Buchstaben enthalten
es: El apellido solo puede contener letras
ru: Фамилия может содержать только буквы
zh_hans: 姓氏只能包含字母

# auth.validation.name.last.too_long %lld
source: Last name must be at most %lld characters
de: Nachname darf höchstens %lld Zeichen lang sein
es: El apellido debe tener como máximo %lld caracteres
ru: Фамилия не должна превышать %lld символов
zh_hans: 姓氏最多 %lld 个字符

# auth.validation.otp.empty
source: Enter the code
de: Code eingeben
es: Introduce el código
ru: Введите код
zh_hans: 请输入验证码

# auth.validation.otp.wrong_length %lld
source: The code must contain %lld digits
de: Der Code muss %lld Ziffern enthalten
es: El código debe contener %lld dígitos
ru: Код должен содержать %lld цифр
zh_hans: 验证码必须为 %lld 位数字

# auth.validation.password.confirm_empty
source: Confirm the password
de: Passwort bestätigen
es: Confirma la contraseña
ru: Подтвердите пароль
zh_hans: 请确认密码

# auth.validation.password.empty
source: Enter a password
de: Passwort eingeben
es: Introduce una contraseña
ru: Введите пароль
zh_hans: 请输入密码

# auth.validation.password.mismatch
source: Passwords do not match
de: Passwörter stimmen nicht überein
es: Las contraseñas no coinciden
ru: Пароли не совпадают
zh_hans: 密码不匹配

# auth.validation.password.strength.medium
source: Medium
de: Mittel
es: Media
ru: Средний
zh_hans: 中等

# auth.validation.password.strength.strong
source: Strong
de: Stark
es: Fuerte
ru: Надёжный
zh_hans: 强

# auth.validation.password.strength.very_strong
source: Very strong
de: Sehr stark
es: Muy fuerte
ru: Очень надёжный
zh_hans: 非常强

# auth.validation.password.strength.very_weak
source: Very weak
de: Sehr schwach
es: Muy débil
ru: Очень слабый
zh_hans: 非常弱

# auth.validation.password.strength.weak
source: Weak
de: Schwach
es: Débil
ru: Слабый
zh_hans: 弱

# auth.validation.password.too_long %lld
source: At most %lld characters
de: Höchstens %lld Zeichen
es: Como máximo %lld caracteres
ru: Максимум %lld символов
zh_hans: 最多 %lld 个字符

# auth.validation.password.too_short %lld
source: At least %lld characters
de: Mindestens %lld Zeichen
es: Al menos %lld caracteres
ru: Минимум %lld символов
zh_hans: 至少 %lld 个字符

# auth.validation.password.too_weak %lld %lld
source: Password is too weak (score: %1$lld/%2$lld)
de: Passwort ist zu schwach (Bewertung: %1$lld/%2$lld)
es: La contraseña es demasiado débil (puntuación: %1$lld/%2$lld)
ru: Пароль слишком слабый (score: %1$lld/%2$lld)
zh_hans: 密码太弱（分数：%1$lld/%2$lld）

# auth.validation.password.too_weak_short
source: Password is too weak
de: Passwort ist zu schwach
es: La contraseña es demasiado débil
ru: Пароль слишком слабый
zh_hans: 密码太弱

# auth.validation.username.empty
source: Enter a username
de: Benutzername eingeben
es: Introduce un nombre de usuario
ru: Введите имя пользователя
zh_hans: 请输入用户名

# auth.validation.username.invalid_chars
source: Letters, digits, _ and - only
de: Nur Buchstaben, Ziffern, _ und -
es: Solo letras, dígitos, _ y -
ru: Только буквы, цифры, _ и -
zh_hans: 仅限字母、数字、_ 和 -

# auth.validation.username.starts_with_digit
source: Must not start with a digit
de: Darf nicht mit einer Ziffer beginnen
es: No debe empezar por un dígito
ru: Не должен начинаться с цифры
zh_hans: 不能以数字开头

# auth.validation.username.taken
source: This username is already taken
de: Dieser Benutzername ist bereits vergeben
es: Este nombre de usuario ya está en uso
ru: Это имя уже занято
zh_hans: 该用户名已被占用
